In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

['yoochoose-data']

In [2]:
# Load Datasets
clicks_df=pd.read_csv('../input/yoochoose-data/yoochoose-clicks.dat',
                      names=['session_id','timestamp','item_id','category'],
                      dtype={'category': str})
display("Clicks Data",)
display(clicks_df.head())

buys_df = pd.read_csv('../input/yoochoose-data/yoochoose-buys.dat', names=['session_id', 'timestamp', 'item_id', 'price', 'quantity'])
display("Buys Data",)
display(buys_df.head())

'Clicks Data'

   session_id                 timestamp    item_id category
0           1  2014-04-07T10:51:09.277Z  214536502        0
1           1  2014-04-07T10:54:09.868Z  214536500        0
2           1  2014-04-07T10:54:46.998Z  214536506        0
3           1  2014-04-07T10:57:00.306Z  214577561        0
4           2  2014-04-07T13:56:37.614Z  214662742        0

'Buys Data'

   session_id                 timestamp    item_id  price  quantity
0      420374  2014-04-06T18:44:58.314Z  214537888  12462         1
1      420374  2014-04-06T18:44:58.325Z  214537850  10471         1
2      281626  2014-04-06T09:40:13.032Z  214535653   1883         1
3      420368  2014-04-04T06:13:28.848Z  214530572   6073         1
4      420368  2014-04-04T06:13:28.858Z  214835025   2617         1

In [3]:
# Explore data

# display(clicks_df.describe())
# display(buys_df.describe())
## The results indicate that buys data session_id and item_id are a subset of clicks data


# (clicks_df.groupby(['session_id', 'item_id']).count()).head(10)
## There can be multiple clicks on the same item in a particular session

(buys_df.groupby(['session_id', 'item_id']).count()).head(10)
## There can be multiple buys of the same item in a particular session.
## Notice this is different from quantity bought.
buys_df[buys_df['session_id']==11]

    session_id                 timestamp    item_id  price  quantity
10          11  2014-04-03T11:04:11.417Z  214821371   1046         1
11          11  2014-04-03T11:04:18.097Z  214821371   1046         1

In [4]:
# Merge clicks and buys data by session and item ids
# merge by left join bcoz clicks_df's session and item ids are a superset of those of buys_df's
df = pd.merge(clicks_df, buys_df, on=['session_id','item_id'], how='left' , suffixes=('_click','_buy'))
print(len(df), len(clicks_df) + len(buys_df))
df.head()

33234442 34154697

   session_id           timestamp_click   ...     price quantity
0           1  2014-04-07T10:51:09.277Z   ...       NaN      NaN
1           1  2014-04-07T10:54:09.868Z   ...       NaN      NaN
2           1  2014-04-07T10:54:46.998Z   ...       NaN      NaN
3           1  2014-04-07T10:57:00.306Z   ...       NaN      NaN
4           2  2014-04-07T13:56:37.614Z   ...       NaN      NaN

[5 rows x 7 columns]

In [5]:
display(clicks_df[clicks_df.session_id==420374])

display(buys_df[buys_df.session_id==420374])

display(df[df.session_id==420374])

         session_id                 timestamp    item_id category
1235499      420374  2014-04-06T18:41:46.649Z  214537888        0
1235500      420374  2014-04-06T18:41:50.292Z  214537888        0
1235501      420374  2014-04-06T18:42:33.117Z  214537850        0
1235502      420374  2014-04-06T18:42:38.784Z  214537850        0
1235503      420374  2014-04-06T18:43:02.611Z  214537888        0
1235504      420374  2014-04-06T18:43:10.786Z  214537888        0

   session_id                 timestamp    item_id  price  quantity
0      420374  2014-04-06T18:44:58.314Z  214537888  12462         1
1      420374  2014-04-06T18:44:58.325Z  214537850  10471         1

         session_id           timestamp_click   ...       price quantity
1249348      420374  2014-04-06T18:41:46.649Z   ...     12462.0      1.0
1249349      420374  2014-04-06T18:41:50.292Z   ...     12462.0      1.0
1249350      420374  2014-04-06T18:42:33.117Z   ...     10471.0      1.0
1249351      420374  2014-04-06T18:42:38.784Z   ...     10471.0      1.0
1249352      420374  2014-04-06T18:43:02.611Z   ...     12462.0      1.0
1249353      420374  2014-04-06T18:43:10.786Z   ...     12462.0      1.0

[6 rows x 7 columns]